In [51]:
import pandas as pd
from src.sql_con import create_db_connection
from src.wr_data import read_data

In [21]:
file_name = "customer_transform.csv"
customer_data = pd.read_csv(f"log_data/{file_name}")

In [22]:
customer_data.valid_from = pd.to_datetime(customer_data.valid_from)

In [23]:
con = create_db_connection("localhost", "root", "RumahMakan02", "sakila")

MySQL database connection successfull

In [32]:
print(pd.io.sql.get_schema(customer_data, "customer_data"))

CREATE TABLE "customer_data" (
"customer_id" INTEGER,
  "full_name" TEXT,
  "is_active" TEXT,
  "address" TEXT,
  "district" TEXT,
  "city" TEXT,
  "country" TEXT,
  "valid_from" TIMESTAMP
)

In [31]:
print(pd.io.sql.get_schema(customer_data, "customer_data", con=con))

CREATE TABLE customer_data (
	customer_id BIGINT,
	full_name TEXT,
	is_active TEXT,
	address TEXT,
	district TEXT,
	city TEXT,
	country TEXT,
	valid_from DATETIME
)

In [34]:
customer_data.head(0).to_sql()

Empty DataFrame
Columns: [customer_id, full_name, is_active, address, district, city, country, valid_from]
Index: []

In [27]:
from sqlalchemy import create_engine

In [28]:
user_name = "root"
user_password = "RumahMakan02"
host_name = "localhost"
create_engine(f'mysql+pymysql://{user_name}:{user_password}@{host_name}')

Engine(mysql+pymysql://root:***@localhost)

In [30]:
con = create_engine(f'mysql+pymysql://{user_name}:{user_password}@{host_name}')

# Insert data

##### customers

In [4]:
data_customers = pd.read_csv("log_data/customer_transform.csv")

In [6]:
data_customers

,customer_id,full_name,is_active,address,district,city,country,valid_from
0,218,VERA MCCOY,Yes,1168 Najafabad Parkway,Kabol,Kabul,Afghanistan,2006-02-14 22:04:36
1,441,MARIO CHEATHAM,Yes,1924 Shimonoseki Drive,Batna,Batna,Algeria,2006-02-14 22:04:37
2,69,JUDY GRAY,Yes,1031 Daugavpils Parkway,Béchar,Béchar,Algeria,2006-02-14 22:04:36
3,176,JUNE CARROLL,Yes,757 Rustenburg Avenue,Skikda,Skikda,Algeria,2006-02-14 22:04:36
4,320,ANTHONY SCHWAB,Yes,1892 Nabereznyje Telny Lane,Tutuila,Tafuna,American Samoa,2006-02-14 22:04:37
...,...,...,...,...,...,...,...,...
594,303,WILLIAM SATTERFIELD,Yes,687 Alessandria Parkway,Sanaa,Sanaa,Yemen,2006-02-14 22:04:37
595,213,GINA WILLIAMSON,Yes,1001 Miyakonojo Lane,Taizz,Taizz,Yemen,2006-02-14 22:04:36
596,7,MARIA MILLER,Yes,900 Santiago de Compostela Parkway,Central Serbia,Kragujevac,Yugoslavia,2006-02-14 22:04:36
597,553,MAX PITT,Yes,1917 Kumbakonam Parkway,Vojvodina,Novi Sad,Yugoslavia,2006-02-14 22:04:37
598,438,BARRY LOVELACE,Yes,1836 Korla Parkway,Copperbelt,Kitwe,Zambia,2006-02-14 22:04:37

In [47]:
con = create_db_connection("localhost", "root", "RumahMakan02", "sakila_dwh")

MySQL database connection successfull

In [11]:
data_customers.head(0).to_sql(name="customers_dim", con=con,if_exists="replace")

0

In [12]:
data_customers.to_sql(name="customers_dim", con=con,if_exists="append")

599

##### Film

In [13]:
data_films = pd.read_csv("log_data/film_extract.csv")

In [16]:
data_films.head(0).to_sql(name="films_dim", con=con,if_exists="replace")

0

In [17]:
data_films.to_sql(name="films_dim", con=con,if_exists="append")

1000

##### Staff

In [19]:
data_staff = pd.read_csv("log_data/staff_extract.csv")

In [21]:
data_staff.head(0).to_sql(name="staff_dim", con=con,if_exists="replace")

0

In [22]:
data_staff.to_sql(name="staff_dim", con=con,if_exists="append")

2

##### Store

In [24]:
data_store = pd.read_csv("log_data/store_extract.csv")

In [26]:
data_store.head(0).to_sql(name="store_dim", con=con,if_exists="replace")

0

In [27]:
data_store.to_sql(name="store_dim", con=con,if_exists="append")

2

##### rental

In [41]:
data_rental = pd.read_csv("log_data/rental_transform.csv")

In [42]:
data_rental

,customer_id,staff_id,store_id,film_id,rental_date,rent_duration,amount
0,431,2,1,1,2005-07-08 19:03:15,3.0,0.99
1,518,1,1,1,2005-08-02 20:13:10,9.0,3.99
2,279,1,1,1,2005-08-21 21:27:43,9.0,3.99
3,411,1,1,1,2005-05-30 20:21:07,7.0,1.99
4,170,2,1,1,2005-06-17 20:24:00,6.0,0.99
...,...,...,...,...,...,...,...
16039,215,2,2,1000,2005-05-29 03:49:03,2.0,4.99
16040,235,2,2,1000,2005-06-15 21:50:32,2.0,4.99
16041,226,2,2,1000,2005-07-12 13:24:47,8.0,9.99
16042,401,2,2,1000,2005-07-31 07:32:21,1.0,4.99
16043,541,2,2,1000,2005-08-19 03:49:28,6.0,7.99

In [43]:
data_rental.head(0).to_sql(name="rental_fact", con=con,if_exists="replace")

0

In [44]:
data_rental.to_sql(name="rental_fact", con=con,if_exists="append")

16044

In [54]:
def insert_data(filename, con, table_name):
    df = read_data(f"log_data/{filename}")
    df.head(0).to_sql(name=table_name, con=con,if_exists="replace", index=False)
    df.to_sql(name=table_name, con=con,if_exists="append", index=False)
    print("data berhasil di insert")

In [50]:
insert_data("log_data/staff_extract.csv", con, "staff_dim")

data berhasil di insert

In [56]:
help(con.execute)

Help on method execute in module sqlalchemy.engine.base:

execute(statement, *multiparams, **params) method of sqlalchemy.engine.base.Engine instance
    Executes the given construct and returns a
    :class:`_engine.CursorResult`.

    .. deprecated:: 1.4 The :meth:`_engine.Engine.execute` method is considered legacy as of the 1.x series of SQLAlchemy and will be removed in 2.0. All statement execution in SQLAlchemy 2.0 is performed by the :meth:`_engine.Connection.execute` method of :class:`_engine.Connection`, or in the ORM by the :meth:`.Session.execute` method of :class:`.Session`. (Background on SQLAlchemy 2.0 at: :ref:`migration_20_toplevel`)

    The arguments are the same as those used by
    :meth:`_engine.Connection.execute`.

    Here, a :class:`_engine.Connection` is acquired using the
    :meth:`_engine.Engine.connect` method, and the statement executed
    with that connection. The returned :class:`_engine.CursorResult`
    is flagged
    such that when the :class:`_engine.CursorResult` is exhausted and its
    underlying cursor is closed, the :class:`_engine.Connection`
    created here
    will also be closed, which allows its associated DBAPI connection
    resource to be returned to the connection pool.

In [58]:
with open("query/query_relasi.py") as f:
    for line in f.readlines():
        print(line)
        print("Hmmmm")

alter_cust =  """ alter table customer_dim

Hmmmm
                  add primary key (customer_id);

Hmmmm
              """

Hmmmm


Hmmmm
alter_film = """

Hmmmm
                alter table film_dim

Hmmmm
                add primary key (film_id);

Hmmmm
             """

Hmmmm


Hmmmm
alter_store= """

Hmmmm
                alter table store_dim

Hmmmm
                add primary key (store_id);

Hmmmm
             """

Hmmmm


Hmmmm
alter_staff= """

Hmmmm
                alter table staff_dim

Hmmmm
                add primary key (staff_id);

Hmmmm
             """

Hmmmm


Hmmmm
alter_rental= """

Hmmmm
            ALTER TABLE rental_fact

Hmmmm
            ADD FOREIGN KEY (customer_id) REFERENCES customer_dim(customer_id)

Hmmmm
            ADD FOREIGN KEY (film_id) REFERENCES customer_dim(film_id)

Hmmmm
            ADD FOREIGN KEY (store_id) REFERENCES customer_dim(store_id)

Hmmmm
            ADD FOREIGN KEY (staff_id) REFERENCES customer_dim(staff_id);

Hmmmm
             """
Hmmmm